---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ErrorInSymbolFamilyResolved
source: html/a6ec4d75-39bd-9c02-c199-4d594470ee0e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ErrorInSymbolFamilyResolved Property

An error occurred in family "[Name]" and was automatically resolved, but may require review by the family creator.\nError Information:\n"[Text]"\nError Resolution: [Resolution]

## Syntax (C#)
```csharp
public static FailureDefinitionId ErrorInSymbolFamilyResolved { get; }
```